app/controllers/kittens_controller.rb

    def index
      @kittens = Kitten.all
---
SELECT "kittens".* FROM "kittens"

    def create
        @kitten = Kitten.new(kitten_params)

        if @kitten.save
---
INSERT INTO "kittens" ("name", "age", "cuteness", "softness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["age", nil], ["cuteness", ""], ["softness", ""], ["created_at", "2023-07-19 00:12:35.519233"], ["updated_at", "2023-07-19 00:12:35.519233"]]

    def set_kitten
      @kitten = Kitten.find(params[:id])
---
SELECT "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]